Catalogs/СпособыОтраженияВФинансовомУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СпособыОтраженияВФинансовомУчете</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КатегорииСтатейРасходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияРасходов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КатегорииРасходовНаПерсонал</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СпособыОтраженияВФинансовомУчете/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Свойства".
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	Если Параметры.Ключ.Пустая() Тогда
		ПриПолученииДанных();
	КонецЕсли;
	
	УстановитьУсловноеОформление(ЭтотОбъект);
	Элементы.АналитикаРасходов.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Проекты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПриПолученииДанных();
	
	НаименованиеВручную = НаименованиеУстановленоВручную();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.КатегорииСтатейРасходов.Очистить();
	
	Для Каждого ТекущаяСтрока Из КатегорииСтатейРасходов Цикл
		Если ТекущаяСтрока.Пометка Тогда
			НоваяСтрока = ТекущийОбъект.КатегорииСтатейРасходов.Добавить();
			НоваяСтрока.КатегорияРасходов = ТекущаяСтрока.Категория;
			НоваяСтрока.СтатьяРасходов = ТекущаяСтрока.СтатьяРасходов;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПриПолученииДанных();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Подсистема "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	Для Каждого СтрокаТаблицы Из КатегорииСтатейРасходов Цикл
		Если СтрокаТаблицы.Пометка И Не ЗначениеЗаполнено(СтрокаТаблицы.СтатьяРасходов) Тогда
			ТекстСообщения = НСтр("ru = 'Статья расходов не заполнена.'");
			НомерСтроки = КатегорииСтатейРасходов.Индекс(СтрокаТаблицы) + 1;
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("КатегорииСтатейРасходов", НомерСтроки, "СтатьяРасходов");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеВручную = НаименованиеУстановленоВручную();
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеДеятельностиПриИзменении(Элемент)
	УстановитьНаименованиеСпособаОтражения();
КонецПроцедуры

&НаКлиенте
Процедура АналитикаРасходовПриИзменении(Элемент)
	УстановитьНаименованиеСпособаОтражения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКатегорииСтатейРасходов

&НаКлиенте
Процедура КатегорииСтатейРасходовПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КатегорииСтатейРасходов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.Пометка Тогда
		ТекущиеДанные.СтатьяРасходов = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из КатегорииСтатейРасходов Цикл
		ТекущаяСтрока.Пометка = Ложь;
		ТекущаяСтрока.СтатьяРасходов = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из КатегорииСтатейРасходов Цикл
		ТекущаяСтрока.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанных()
	
	ЗаполнитьКатегорииРасходов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКатегорииРасходов()
	
	Если КатегорииСтатейРасходов.Количество() > 0 Тогда
		КатегорииСтатейРасходов.Очистить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КатегорииРасходовНаПерсонал.Ссылка КАК Категория,
		|	ЕСТЬNULL(КатегорииСпособовОтражения.СтатьяРасходов, НЕОПРЕДЕЛЕНО) КАК СтатьяРасходов,
		|	ВЫБОР
		|		КОГДА КатегорииСпособовОтражения.КатегорияРасходов ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Пометка,
		|	КатегорииРасходовНаПерсонал.Порядок КАК Порядок
		|ИЗ
		|	Перечисление.КатегорииРасходовНаПерсонал КАК КатегорииРасходовНаПерсонал
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияВФинансовомУчете.КатегорииСтатейРасходов КАК КатегорииСпособовОтражения
		|		ПО КатегорииРасходовНаПерсонал.Ссылка = КатегорииСпособовОтражения.КатегорияРасходов
		|		И КатегорииСпособовОтражения.Ссылка = &Ссылка
		|ГДЕ
		|	КатегорииРасходовНаПерсонал.Ссылка В (&Категории)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Категории", ФинансовыйУчет.КатегорииФинансовогоУчета());
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(КатегорииСтатейРасходов.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНаименованиеСпособаОтражения()
	
	Если НаименованиеВручную Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Наименование = АвтоНаименование();
	
КонецПроцедуры

&НаСервере
Функция АвтоНаименование()
	
	Возврат ?(ЗначениеЗаполнено(Объект.НаправлениеДеятельности), Строка(Объект.НаправлениеДеятельности), "")
		+ ?(ЗначениеЗаполнено(Объект.АналитикаРасходов), " /" + Строка(Объект.АналитикаРасходов) + "/", "");
	
КонецФункции

&НаСервере
Функция НаименованиеУстановленоВручную()
	
	Возврат ЗначениеЗаполнено(Объект.Наименование) И Объект.Наименование <> АвтоНаименование();
	
КонецФункции

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

///////////////////////////////////////////////////////////////////// 
// Процедуры подсистемы Свойства.

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформление(Форма)
	
	Элементы = Форма.Элементы;
	УсловноеОформление = Форма.УсловноеОформление;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КатегорииСтатейРасходовКатегория.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, "КатегорииСтатейРасходов.Пометка", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КатегорииСтатейРасходовСтатьяРасходов.Имя);
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "КатегорииСтатейРасходов.Пометка", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "КатегорииСтатейРасходов.СтатьяРасходов", ,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
КонецПроцедуры

#КонецОбласти
